teresasa0731/STM32_Testhouse/PID_F446RE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define encoder3A_Pin GPIO_PIN_0
#define encoder3A_GPIO_Port GPIOA
#define encoder3B_Pin GPIO_PIN_1
#define encoder3B_GPIO_Port GPIOA
#define motor1A_Pin GPIO_PIN_7
#define motor1A_GPIO_Port GPIOA
#define motor2B_Pin GPIO_PIN_0
#define motor2B_GPIO_Port GPIOB
#define motor3B_Pin GPIO_PIN_14
#define motor3B_GPIO_Port GPIOB
#define motor3A_Pin GPIO_PIN_7
#define motor3A_GPIO_Port GPIOC
#define motor1B_Pin GPIO_PIN_8
#define motor1B_GPIO_Port GPIOA
#define motor2A_Pin GPIO_PIN_9
#define motor2A_GPIO_Port GPIOA
#define encoder1A_Pin GPIO_PIN_15
#define encoder1A_GPIO_Port GPIOA
#define encoder1B_Pin GPIO_PIN_3
#define encoder1B_GPIO_Port GPIOB
#define encoder2A_Pin GPIO_PIN_6
#define encoder2A_GPIO_Port GPIOB
#define encoder2B_Pin GPIO_PIN_7
#define encoder2B_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
